Playing-with-r2frida.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-14 Sat 16:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content" class="content">
<ul class="org-ul">
<li><a href="index.html">home</a></li>
</ul>
<div id="outline-container-org1480ef0" class="outline-2">
<h2 id="org1480ef0">Playing with r2frida</h2>
<div class="outline-text-2" id="text-org1480ef0">
<p>
<a href="https://www.radare.org/r/">Radare2</a> and <a href="https://frida.re/">frida</a> are some of my favourite tools, mainly because once you get over the steep learning curve they are fantastic at what they do. A bit like <code>emacs</code>, in that once you have your setup the way you want it, you'll learn more tinkering. Well the other day I stumbled across <a href="https://github.com/nowsecure/r2frida">r2frida</a>.
</p>
</div>

<div id="outline-container-orgb171248" class="outline-3">
<h3 id="orgb171248">Install</h3>
<div class="outline-text-3" id="text-orgb171248">
<p>
Your going to have to have <code>radare2</code> and <code>frida</code> installed ofcourse, and theres a few other dependencies too install too.
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo apt install -y make gcc libzip-dev nodejs npm curl pkg-config git
</pre>
</div>

<p>
Once installed, you can use <code>r2pm</code> to install <code>r2frida</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell">r2pm -ci r2frida
</pre>
</div>

<p>
Your also going to need frida on your target device, but thats a littl out of scope for this post.
</p>
</div>
</div>
<div id="outline-container-org74820db" class="outline-3">
<h3 id="org74820db">Connecting to target with <code>r2frida</code></h3>
<div class="outline-text-3" id="text-org74820db">
<p>
The <code>README</code> outlines this, but here is a quick guide to connect and spawn an app on the device.
</p>

<p>
First we need to get the identifier of the target device, and we can use frida to do that.
</p>

<div class="org-src-container">
<pre class="src src-shell">frida-ls-devices
</pre>
</div>

<pre class="example">
Id                                        Type    Name        
----------------------------------------  ------  ------------
local                                     local   Local System
e1bbe59525c47da47dd89ed4421800f38fbe7cb5  usb     iOS Device  
socket                                    remote  Local Socket
</pre>


<p>
Great, now to use <code>r2firda</code> to spawn and connect to an app we can use the following command.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">r2 frida://spawn/usb/&lt;Device Id&gt;/&lt;Gadget&gt;</span>
r2 frida://spawn/usb/e1bbe59525c47da47dd89ed4421800f38fbe7cb5/com.hammerandchisel.discord
</pre>
</div>

<p>
Once connected however the app with pause (like it does in the frida repl) so to continue the process we need to type <code>\dc</code> (Continue breakpoints or resume a spawned process).
</p>

<p>
Now we can run specfic <code>r2frida</code> commands that are prepended with <code>\</code>.
</p>

<pre class="example" id="orgfad682b">
[0x00000000]&gt; \?
r2frida commands available via =! or \ prefix

[...]
</pre>
</div>
</div>

<div id="outline-container-org58da050" class="outline-3">
<h3 id="org58da050">Search Example</h3>
<div class="outline-text-3" id="text-org58da050">
<p>
In <code>radare2</code> to search for a pattern you'd use the <code>/ &lt;pattern&gt;</code> command, well with <code>r2frida</code> its the same but prepended with <code>\</code>.
</p>

<pre class="example" id="org407f738">
[0x00000000]&gt; \/ jail
Searching 4 bytes: 6a 61 69 6c
Searching 4 bytes in [0x0000000100bf4000-0x0000000100c04000]
[...]
Searching 4 bytes in [0x0000000262600000-0x00000002626cc000]
Searching 4 bytes in [0x00000002646cc000-0x000000026bf84000]
Searching 4 bytes in [0x0000000280000000-0x00000002a0000000]
hits: 32
0x10190fe97 hit1_0 jailbroken
0x10798d4d2 hit1_1 jailbreak dectection tonight .. do you want a copy, or do yo
0x108c37dbb hit1_2 jailbreak dectection tonight .. do you want a copy, or do yo
0x108c768ff hit1_3 jailbreak dectection tonight .. do you want a copy, or do yo
0x108cb9b89 hit1_4 jailbreak dectection tonight .. do you want a copy, or do yo
0x108cd72a9 hit1_5 jailbreak dectection tonight .. do you want a copy, or do yo
0x108cf52f6 hit1_6 jailbreak dectection tonight .. do you want a copy, or do yo
0x109548ebd hit1_7 jailbreak dectection tonight .. do you want a copy, or do yo
0x10b10c603 hit1_8 jailbreak dectection tonight .. do you want a copy, or do yo
0x10d01820d hit1_9 jailbreak dectection tonight 
0x10d01825d hit1_10 jailbreak dectection tonight 
0x10d83b7ad hit1_11 jailbreak dectection tonight "
0x10d83b7fd hit1_12 jailbreak dectection tonight I
0x22910a4c0 hit1_13 jail ls,zls,saamrd: ka p Ts odgtuizbmsmi
0x22976cce8 hit1_14 jail.com
0x2297748b9 hit1_15 jailinmatesearch.com
0x22978149f hit1_16 jailaflemme.fr
0x2297963f9 hit1_17 jailbreakingisnotacrime.org
0x2389c5635 hit1_18 jailedReferenceBoundsInPixels
0x23a75c859 hit1_19 jailedReferenceBoundsInPixels
0x24e3631fe hit1_20 jailedProjects
0x24e363780 hit1_21 jailedProjects
0x255c9ee2f hit1_22 jailedReferenceBounds
0x255c9ee48 hit1_23 jailedReferenceBoundsInPixels
0x255c9ee69 hit1_24 jailedReferenceBoundsForInterfaceOrientation:
0x255eaaf3a hit1_25 jailed bounds, ending
0x281fe6e51 hit1_26 jailbroken
0x2826c0560 hit1_27 jailbreak dectection tonight .. do you want a copy, or do yo
0x2826cb3c0 hit1_28 jailbreak dectection tonight .. do you want a copy, or do yo
0x2826cb580 hit1_29 jailbreak dectection tonight .. do you want a copy, or do yo
0x2826cb660 hit1_30 jailbreak dectection tonight .. do you want a copy, or do yo
0x2828c8500 hit1_31 jailbreak dectection tonight .. do you want a copy, or do yo

[0x00000000]&gt; 

</pre>

<p>
When doing mobile testing its also nice to have a list of classes that that app uses. We can get that with the <code>\ic</code> command, and the <code>\icl</code> command for a list of classes that have been loaded.
</p>

<pre class="example" id="org4e4eba7">
[0x00000000]&gt; \icl
Do you want to print 26214 lines? (y/N) y
PFEmbeddedMulticasterImplementation
PFMulticasterDistributionMethods
_PFMainThreadReleaseMethods
PFChecksum
PFTaggedPointer
PFBlockControl
PFPipeline
PFPipelineStage
PFPipelineStage0
PFSelectorPipelineStage
PFPipelineJobGeneratorInfo
PFPipelineIndeterminiteJobGeneratorInfo
PFPipelineDeterminiteJobGeneratorInfo
PFPipelineJobInfo
PFLimitedConcurrencySlotQueue
PFDiskCacheFile
PFUtilities

[...]
</pre>

<p>
Like with any <code>radare2</code> command, this can be filtered.
</p>

<pre class="example" id="org24e708c">
[0x00000000]&gt; \icl~+discord
discord_ios_discord_ios_swift_lib.Networking
discord_ios_discord_ios_swift_lib.ContactSyncEncryption
discord_ios_discord_ios_swift_lib.DCDRoundedCornerView
discord_ios_discord_ios_swift_lib.DCDQRScanner
discord_ios_discord_ios_swift_lib.DCDMessageLoadingSpinner
discord_ios_discord_ios_swift_lib.DCDSegmentedControl
discord_ios_discord_ios_swift_lib.DCDTableView
</pre>
</div>
</div>

<div id="outline-container-orgff1b520" class="outline-3">
<h3 id="orgff1b520">Inspecting Memory</h3>
<div class="outline-text-3" id="text-orgff1b520">
<p>
With the <code>\dm</code> command we can see the memory regions. With the <code>\dmm</code> command its then possible to show the memory maps.
</p>

<pre class="example" id="orgff9c199">
[0x00000000]&gt; \dmm
0x0000000100bf4000 - 0x0000000101f6e000 rwx /private/var/containers/Bundle/Application/98F28445-DD8E-4E52-90D7-2C55B994F911/Discord.app/Discord
0x00000001021bc000 - 0x000000010227f000 rwx /binpack/lib/dyld
0x00000001022a0000 - 0x00000001022a4000 rwx /private/var/preferences/Logging/.plist-cache.Bw2gXuOr
0x00000001027a4000 - 0x00000001027e1000 rwx /usr/lib/libobjc-trampolines.dylib
0x00000001027e8000 - 0x0000000103800000 rwx /usr/share/icu/icudt62l.dat
0x000000010598c000 - 0x00000001059d1000 rwx /private/var/containers/Bundle/Application/98F28445-DD8E-4E52-90D7-2C55B994F911/Discord.app/Assets.car
0x00000001059d8000 - 0x0000000105c74000 rwx /private/var/mobile/Containers/Data/Application/90140E80-1450-4642-89ED-7CD8CC067C57/Library/Caches/com.hammerandchisel.discord/Cache.db-shm
0x0000000105fc0000 - 0x0000000106b01000 rwx /System/Library/PrivateFrameworks/UIKitCore.framework/Artwork.bundle/Assets.car
0x0000000106b08000 - 0x0000000106b2c000 rwx /System/Library/PrivateFrameworks/ProofReader.framework/gbindict
0x0000000106b54000 - 0x0000000106b67000 rwx /System/Library/PrivateFrameworks/ProofReader.framework/English.lproj/bindict4
0x0000000106bf4000 - 0x0000000106bfe000 rwx /System/Library/PrivateFrameworks/ProofReader.framework/English.lproj/bindict7
0x0000000107b48000 - 0x0000000107d03000 rwx /System/Library/PrivateFrameworks/ProofReader.framework/gnamebindict
0x0000000107d08000 - 0x0000000107d72000 rwx /System/Library/PrivateFrameworks/ProofReader.framework/English.lproj/bindict
0x0000000107d78000 - 0x0000000107dbb000 rwx /private/var/db/timezone/tz/2020d.1.0/icutz/icutz44l.dat
0x0000000107de0000 - 0x00000001081e3000 rwx /usr/share/langid/langid.inv
0x00000001088dc000 - 0x0000000108d2b000 rwx /System/Library/LinguisticData/RequiredAssets_en.bundle/AssetData/Delta-en_GB.idx
0x0000000108d54000 - 0x0000000108d7c000 rwx /private/var/mobile/Library/Caches/com.apple.UIStatusBar/16G201/images/103902009632437770076865854842937718261
0x0000000108df4000 - 0x00000001092a1000 rwx /System/Library/LinguisticData/RequiredAssets_en.bundle/AssetData/Unigrams-en.idx
0x0000000109370000 - 0x0000000109429000 rwx /System/Library/LinguisticData/RequiredAssets_en.bundle/AssetData/Delta-en_GB.dat
0x0000000109458000 - 0x00000001094a2000 rwx /private/var/containers/Bundle/Application/98F28445-DD8E-4E52-90D7-2C55B994F911/Discord.app/whitney-italic.ttf
0x00000001094bc000 - 0x00000001094e3000 rwx /private/var/containers/Bundle/Application/98F28445-DD8E-4E52-90D7-2C55B994F911/Discord.app/whitney-light.ttf
0x00000001094f8000 - 0x000000010950b000 rwx /private/var/containers/Bundle/Application/98F28445-DD8E-4E52-90D7-2C55B994F911/Discord.app/whitney-semibold.ttf
0x0000000109600000 - 0x000000010c2bb000 rwx /System/Library/Fonts/CoreUI/SFUIText.ttf
0x000000010c2ec000 - 0x000000010d21f000 rwx /System/Library/Fonts/Core/Helvetica.ttc
0x000000010eb9c000 - 0x000000010ef52000 rwx /System/Library/Fonts/Core/Courier.ttc
0x000000010f24c000 - 0x0000000111cee000 rwx /System/Library/Fonts/Core/AppleColorEmoji@2x.ttc
0x0000000228800000 - 0x0000000256e24000 rwx /Library/Caches/frida-EJ74S0.dylib

[0x00000000]&gt; 

</pre>

<p>
More &amp; better examples at <a href="https://github.com/enovella/r2frida-wiki">r2frida-wiki</a>.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
